Offwind.App/Offwind.Wpf/Templates/precursorABL/unstable/0.original/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            buoyantPressureMod;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }
    top
    {
        type            buoyantPressureMod;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }
    west 
    {
        type            cyclic;
    }
    east
    {
        type            cyclic;
    }
    north
    {
        type            cyclic;
    }
    south 
    {
        type            cyclic;
    }
}


// ************************************************************************* //
