Offwind.App/Offwind.Wpf/Templates/precursorABL/unstable/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices        
(
    (   0.0    0.0    0.0)
    (3000.0    0.0    0.0)
    (3000.0 3000.0    0.0)
    (   0.0 3000.0    0.0)
    (   0.0    0.0 1000.0)
    (3000.0    0.0 1000.0)
    (3000.0 3000.0 1000.0)
    (   0.0 3000.0 1000.0)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (75 75 25) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    bottom 
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top 
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    west
    { 
        type cyclic;
        neighbourPatch east;
        faces
        (
            (0 4 7 3)
        );
    }
    east
    { 
        type cyclic;
        neighbourPatch west;
        faces
        (
            (1 2 6 5)
        );
    }
    north
    { 
        type cyclic;
        neighbourPatch south;
        faces
        (
            (3 7 6 2)
        );
    }
    south
    { 
        type cyclic;
        neighbourPatch north;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
