Offwind.App/Offwind.Wpf/Templates/precursorABL/unstable/system/controlDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

  application       ABLPisoSolver;

  libs              ("libuserfiniteVolume.so");

  startFrom         startTime;

  startTime         0.0;

  stopAt            endTime;

  endTime           12000.0;

  deltaT            0.5;

  writeControl      adjustableRunTime;

  writeInterval     2000.0; 

  purgeWrite        0;

  writeFormat       binary;

  writePrecision    12;

  writeCompression  compressed;

  timeFormat        general;

  timePrecision     12;

  runTimeModifiable yes;

  adjustTimeStep    yes;

  maxCo             0.75;

  maxDeltaT         25.0;

// ************************************************************************* //
