Offwind.App/Offwind.Wpf/Templates/precursorABL/unstable/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name         domain;
        type         cellSet;
        action       new;
        source       boxToCell;
        sourceInfo
        {
            box (-0.1 -0.1 -0.1) ( 3000.1 3000.1 1000.1);
        }
    }
);

// ************************************************************************* //
